mindThomas/STM32-libraries/Periphirals/STM32G4/SyncedPWMADC/SyncedPWMADC.cpp
/* Copyright (C) 2020 Thomas Jespersen, TKJ Electronics. All rights reserved.
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the MIT License
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the MIT License for further details.
 *
 * Contact information
 * ------------------------------------------
 * Thomas Jespersen, TKJ Electronics
 * Web      :  http://www.tkjelectronics.dk
 * e-mail   :  thomasj@tkjelectronics.dk
 * ------------------------------------------
 */
 
#include "SyncedPWMADC.h"
#include "stm32g4xx_hal.h"
#include "Debug.h"
#include <string.h> // for memset
#include <math.h> // for roundf
 
#ifndef USE_FREERTOS
#include <malloc.h>
#endif

SyncedPWMADC * SyncedPWMADC::globalObject = 0;

// Necessary to export for compiler to generate code to be called by interrupt vector
extern "C" __EXPORT void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc);

SyncedPWMADC::SyncedPWMADC(uint32_t frequency, float maxDuty)
{
	if (globalObject) {
		ERROR("Synced PWM/ADC object has already been created once");
		return;
	}
	globalObject = this;

	// Default settings
	timerSettingsNext.Frequency = frequency;
	timerSettingsNext.DutyCycle = 0;
	timerSettingsNext.Direction = true;
	_PWM_maxDuty = maxDuty;
	if (SAMPLE_IN_EVERY_PWM_CYCLE) {
		timerSettingsNext.samplingInterval = 1; // sample every PWM period
	} else {
		timerSettingsNext.samplingInterval = 2; // sample every second PWM period (with SAMPLE_IN_EVERY_PWM_CYCLE=false, this is the fastest possible)
	}
	timerSettingsNext.samplingAveragingNumSamples = 1; // capture samples from one PWM period after every interval (hence every PWM period)
	timerSettingsNext.InvalidateSamples = 0;
	timerSettingsNext.BemfAlternateRange = false;
	timerSettingsNext.BemfHighRange = true;
	_DMA_ADC1_ongoing = false;
	_DMA_ADC2_ongoing = false;
	_TimerEnabled = false;
	_SamplingEnabled = false;

#ifdef USE_FREERTOS
	_sampleAvailable = xSemaphoreCreateBinary();
	if (_sampleAvailable == NULL) {
		ERROR("Could not create ADC-PWM Sample available semaphore");
		return;
	}
	vQueueAddToRegistry(_sampleAvailable, "ADC-PWM Sample Available");
#else
	_sampleAvailable = false;
#endif

#ifdef USE_FREERTOS
	_sampleAddedToQueue = xSemaphoreCreateBinary();
	if (_sampleAddedToQueue == NULL) {
		ERROR("Could not create ADC-PWM Sample added to queue semaphore");
		return;
	}
	vQueueAddToRegistry(_sampleAddedToQueue, "ADC-PWM Queued Sample Available");
#endif

#ifdef USE_FREERTOS
	_timerSettingsMutex = xSemaphoreCreateBinary();
	if (_timerSettingsMutex == NULL) {
		ERROR("Could not create ADC-PWM Timer settings mutex");
		return;
	}
	vQueueAddToRegistry(_timerSettingsMutex, "ADC-PWM Timer settings");
	xSemaphoreGive( _timerSettingsMutex ); // give the semaphore the first time
#endif

#ifdef USE_FREERTOS
#if SAMPLE_QUEUE_SIZE > 0
	SampleQueue = xQueueCreate( SAMPLE_QUEUE_SIZE, sizeof(CombinedSample_t) );
	if (SampleQueue == NULL) {
		ERROR("Could not create Samples queue");
		return;
	}
	vQueueAddToRegistry(SampleQueue, "Samples queue");
#endif
#endif

	ConfigureDigitalPins();
	ConfigureAnalogPins();
	InitOpAmps();
	InitADCs(); // configures ADC in Current sense mode
	InitDMAs();
	InitTimer(frequency); // configures PWM in Brake mode
	RecomputePredefinedCounts();

	StartSampling();
	StartPWM();
}

SyncedPWMADC::~SyncedPWMADC()
{
	StopPWM();
	StopSampling();

	DeInitTimer();
	DeInitDMAs();
	DeInitADCs();
	DeInitOpAmps();
	DeInitAnalogPins();
	DeInitDigitalPins();
}

void SyncedPWMADC::SetOperatingMode(OperatingMode_t mode)
{
	_operatingMode = mode;

	if (_operatingMode == BRAKE) {
		ADC_ConfigureCurrentSenseSampling();
		Timer_ConfigureBrakeMode();
	}
	else if (_operatingMode == COAST) {
		//ADC_ConfigureBackEMFSampling();
		ADC_ConfigureCoastModeSampling();
		Timer_ConfigureCoastMode(timerSettingsCurrent.Direction);
	}
}

SyncedPWMADC::OperatingMode_t SyncedPWMADC::GetOperatingMode(void)
{
	return _operatingMode;
}

void SyncedPWMADC::SetBemfRange(bool auto_range, bool high_range, bool alternating_range)
{
	// OBS! Only enable auto_range if Bemf is calibrated
	timerSettingsNext.BemfAutoRange = auto_range;
	timerSettingsNext.BemfHighRange = high_range;
	timerSettingsNext.BemfAlternateRange = alternating_range;
}

void SyncedPWMADC::SetPWMFrequency(uint32_t frequency, bool fixed_prescaler)
{
	Timer_Configure(frequency, fixed_prescaler);
	RecomputePredefinedCounts(); // recompute at different frequency
}

/*
void SyncedPWMADC::SetDutyCycle(float duty)
{
	xSemaphoreTake( _timerSettingsMutex, ( TickType_t ) portMAX_DELAY ); // lock settings for change

	timerSettingsNext.DutyCycle = duty;

	if (timerSettingsNext.DutyCycle > _PWM_maxDuty)
		timerSettingsNext.DutyCycle = _PWM_maxDuty;
	else if (timerSettingsNext.DutyCycle < -_PWM_maxDuty)
		timerSettingsNext.DutyCycle = -_PWM_maxDuty;

	if (timerSettingsNext.DutyCycle > 0)
		timerSettingsNext.Direction = true;
	else if (timerSettingsNext.DutyCycle < 0)
		timerSettingsNext.Direction = false;

	// OBS! This function is not complete. Use the functions below where the sample location is specified
	// This function should be extended to automatically chose the current sampling scheme based on a stored parameter such that the sampling scheme can be configured/selected once

	xSemaphoreGive( _timerSettingsMutex ); // unlock settings
}
*/

float SyncedPWMADC::GetCurrentDutyCycle()
{
	return timerSettingsCurrent.DutyCycle;
}

bool SyncedPWMADC::GetCurrentDirection()
{
	return timerSettingsCurrent.Direction;
}

void SyncedPWMADC::RecomputePredefinedCounts()
{
	const uint32_t ADC_SAMPLE_TIME_US = _ADC_SampleTime_Total_us + ADC_SAMPLE_TIME_OVERHEAD_US;
	const uint16_t PWM_RIPPLE_TIME_US = ADC_PWM_RIPPLE_TIME_US;

	// Duty cycle is defined as:
	// Duty Cycle = (CCR+1) / (ARR+1)
	// So 100% duty cycle is achieved by setting CCR=ARR
	// Note that CCR is the Capture Compare Register value, computed as
	// CCR = (Duty * (ARR+1)) - 1
	PredefinedCounts.End = hTimer.Init.Period + 1; // ARR+1

	// Sample_DutyPct = ADC_SAMPLE_TIME_US*1e-6 / (1/PWM_frequency)
	float Sample_DutyPct = (float)((uint32_t)(timerSettingsNext.Frequency) * ADC_SAMPLE_TIME_US) / 1000000.f;
	PredefinedCounts.Sample = (uint16_t)(ceilf( fabsf(Sample_DutyPct)*PredefinedCounts.End ));

	float Ripple_DutyPct = (float)((uint32_t)(timerSettingsNext.Frequency) * PWM_RIPPLE_TIME_US) / 1000000.f;
	PredefinedCounts.Ripple = (uint16_t)(ceilf( fabsf(Ripple_DutyPct)*PredefinedCounts.End ));
}

void SyncedPWMADC::SetDutyCycle_MiddleSampling(float dutyPct)
{
	xSemaphoreTake( _timerSettingsMutex, ( TickType_t ) portMAX_DELAY ); // lock settings for change

	timerSettingsNext.DutyCycle = dutyPct;

	if (timerSettingsNext.DutyCycle > _PWM_maxDuty)
		timerSettingsNext.DutyCycle = _PWM_maxDuty;
	else if (timerSettingsNext.DutyCycle < -_PWM_maxDuty)
		timerSettingsNext.DutyCycle = -_PWM_maxDuty;

	if (timerSettingsNext.DutyCycle > 0)
		timerSettingsNext.Direction = true;
	else if (timerSettingsNext.DutyCycle < 0)
		timerSettingsNext.Direction = false;

